
## Terraform Comment

**Project:** terraform/projects/mathews-mrr-stg

**Command:** plan

**Outcome:** success

<details>
  <summary>
    <b>Output: </b>
  </summary>

  <pre>module.service.google_project_service.main["run.googleapis.com"]: Refreshing state... [id=mathews-mrr-stg/run.googleapis.com]
module.service.google_project_service.main["artifactregistry.googleapis.com"]: Refreshing state... [id=mathews-mrr-stg/artifactregistry.googleapis.com]
module.service.google_project_service.main["iam.googleapis.com"]: Refreshing state... [id=mathews-mrr-stg/iam.googleapis.com]
module.dbt_project_bucket.google_storage_bucket.main: Refreshing state... [id=mathews-mrr-stg-dbt-project-bucket]
module.bigquery.google_bigquery_dataset.main: Refreshing state... [id=projects/mathews-mrr-stg/datasets/raw]
module.bigquery.google_bigquery_table.main["incomes"]: Refreshing state... [id=projects/mathews-mrr-stg/datasets/raw/tables/google_sheets__incomes]
module.dbt_project_sa.google_service_account.main: Refreshing state... [id=projects/mathews-mrr-stg/serviceAccounts/dbt-project@mathews-mrr-stg.iam.gserviceaccount.com]
module.artifact_registry.google_artifact_registry_repository.main: Refreshing state... [id=projects/mathews-mrr-stg/locations/us-central1/repositories/dbt-project]
module.dbt_project_sa.google_project_iam_member.main["roles/bigquery.user"]: Refreshing state... [id=mathews-mrr-stg/roles/bigquery.user/serviceAccount:dbt-project@mathews-mrr-stg.iam.gserviceaccount.com]
module.dbt_project_sa.google_project_iam_member.main["roles/bigquery.dataEditor"]: Refreshing state... [id=mathews-mrr-stg/roles/bigquery.dataEditor/serviceAccount:dbt-project@mathews-mrr-stg.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dbt_project_sa.google_project_iam_member.main["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_project_iam_member" "main" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:dbt-project@mathews-mrr-stg.iam.gserviceaccount.com"
      + project = "mathews-mrr-stg"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.evidence_sa.google_project_iam_member.main["roles/bigquery.user"] will be created
  + resource "google_project_iam_member" "main" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:evidence@mathews-mrr-stg.iam.gserviceaccount.com"
      + project = "mathews-mrr-stg"
      + role    = "roles/bigquery.user"
    }

  # module.evidence_sa.google_project_iam_member.main["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_project_iam_member" "main" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:evidence@mathews-mrr-stg.iam.gserviceaccount.com"
      + project = "mathews-mrr-stg"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.evidence_sa.google_service_account.main will be created
  + resource "google_service_account" "main" {
      + account_id                   = "evidence"
      + create_ignore_already_exists = true
      + description                  = "Evidence Service Account"
      + disabled                     = false
      + display_name                 = "evidence"
      + email                        = "evidence@mathews-mrr-stg.iam.gserviceaccount.com"
      + id                           = (known after apply)
      + member                       = "serviceAccount:evidence@mathews-mrr-stg.iam.gserviceaccount.com"
      + name                         = (known after apply)
      + project                      = "mathews-mrr-stg"
      + unique_id                    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: mathews-mrr-stg

To perform exactly these actions, run the following command to apply:
    terraform apply "mathews-mrr-stg"
</pre>
</details>
